WorkReports/JoarWandborg/2013-10/work.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Consulting Services for Software Freedom Conservancy in October 2013</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Consulting Services for Software Freedom Conservancy in October 2013"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-11-08T20:48+0100"/>
<meta name="author" content="Joar Wandborg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Consulting Services for Software Freedom Conservancy in October 2013</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 2013-10-22</a>
<ul>
<li><a href="#sec-1-1">1.1 Set up ikiwiki wiki</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Set up nginx, fcgiwrap, spawn-fcgi, system accounts</a></li>
<li><a href="#sec-1-1-2">1.1.2 Filed a feature request with gitorirous</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Set up an IRC log bot</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Tried out eggdrop</a></li>
<li><a href="#sec-1-2-2">1.2.2 Tried out ibid</a></li>
<li><a href="#sec-1-2-3">1.2.3 Decided on supybot</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 Set up nginx to publish the IRC logs</a></li>
</ul>
</li>
<li><a href="#sec-2">2 2013-10-23</a>
<ul>
<li><a href="#sec-2-1">2.1 Theme wiki</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Adapted ikiwiki bootstrap 2.x theme file</a></li>
<li><a href="#sec-2-1-2">2.1.2 Adapted the wiki theme to smaller devices</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 Compiled a list of existing projects</a></li>
<li><a href="#sec-2-3">2.3 Preliminary evaluation of existing projects</a></li>
<li><a href="#sec-2-4">2.4 Reading on the subject of double-entry accounting</a></li>
<li><a href="#sec-2-5">2.5 Reading on the subject of fund accounting</a></li>
</ul>
</li>
<li><a href="#sec-3">3 2013-10-24</a>
<ul>
<li><a href="#sec-3-1">3.1 Practicing double-entry fund accounting</a></li>
<li><a href="#sec-3-2">3.2 Enabled easy page creation in the wiki</a></li>
<li><a href="#sec-3-3">3.3 Researched use cases and created a UseCases section in the wiki</a></li>
</ul>
</li>
<li><a href="#sec-4">4 2013-10-25</a>
<ul>
<li><a href="#sec-4-1">4.1 Practicing ledger-cli and reviewing the examples in npo-ledger-cli</a></li>
<li><a href="#sec-4-2">4.2 Writing use cases, researching accounting principles</a></li>
</ul>
</li>
<li><a href="#sec-5">5 2013-10-28</a>
<ul>
<li><a href="#sec-5-1">5.1 Preliminary evaluation SQL-Ledger, HomeBank, JFire, SFCs ledger setup</a></li>
</ul>
</li>
<li><a href="#sec-6">6 2013-10-29</a>
<ul>
<li><a href="#sec-6-1">6.1 Preliminary evaluations, continued</a></li>
<li><a href="#sec-6-2">6.2 Evaluation of ledger's python bindings</a></li>
</ul>
</li>
<li><a href="#sec-7">7 2013-10-30</a>
<ul>
<li><a href="#sec-7-1">7.1 Preliminary evaluations: OpenERP, Tryton</a></li>
<li><a href="#sec-7-2">7.2 Wiki editing</a></li>
</ul>
</li>
<li><a href="#sec-8">8 2013-10-31</a>
<ul>
<li><a href="#sec-8-1">8.1 Preliminary evaluations: ADempiere, Phreedom, TurboCASH</a></li>
<li><a href="#sec-8-2">8.2 Call for comments</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 2013-10-22</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Set up ikiwiki wiki</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Set up nginx, fcgiwrap, spawn-fcgi, system accounts</h4>
<div class="outline-text-4" id="text-1-1-1">

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Filed a feature request with gitorirous</h4>
<div class="outline-text-4" id="text-1-1-2">

<p>    <a href="https://issues.gitorious.org/issues/333">https://issues.gitorious.org/issues/333</a>
</p></div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Set up an IRC log bot</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Tried out eggdrop</h4>
<div class="outline-text-4" id="text-1-2-1">

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Tried out ibid</h4>
<div class="outline-text-4" id="text-1-2-2">

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Decided on supybot</h4>
<div class="outline-text-4" id="text-1-2-3">

<ul>
<li id="sec-1-2-3-1">Set up logging for supybot<br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Set up nginx to publish the IRC logs</h3>
<div class="outline-text-3" id="text-1-3">

</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2013-10-23</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Theme wiki</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Adapted ikiwiki bootstrap 2.x theme file</h4>
<div class="outline-text-4" id="text-2-1-1">

<p>    .. to use bootstrap 3.0 and not use site-specific plugins.
</p></div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Adapted the wiki theme to smaller devices</h4>
<div class="outline-text-4" id="text-2-1-2">

</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Compiled a list of existing projects</h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Preliminary evaluation of existing projects</h3>
<div class="outline-text-3" id="text-2-3">

</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Reading on the subject of double-entry accounting</h3>
<div class="outline-text-3" id="text-2-4">

</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Reading on the subject of fund accounting</h3>
<div class="outline-text-3" id="text-2-5">

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 2013-10-24</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Practicing double-entry fund accounting</h3>
<div class="outline-text-3" id="text-3-1">

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Enabled easy page creation in the wiki</h3>
<div class="outline-text-3" id="text-3-2">

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Researched use cases and created a UseCases section in the wiki</h3>
<div class="outline-text-3" id="text-3-3">

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 2013-10-25</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Practicing ledger-cli and reviewing the examples in npo-ledger-cli</h3>
<div class="outline-text-3" id="text-4-1">

</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Writing use cases, researching accounting principles</h3>
<div class="outline-text-3" id="text-4-2">

</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 2013-10-28</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Preliminary evaluation SQL-Ledger, HomeBank, JFire, SFCs ledger setup</h3>
<div class="outline-text-3" id="text-5-1">

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 2013-10-29</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Preliminary evaluations, continued</h3>
<div class="outline-text-3" id="text-6-1">

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Evaluation of ledger's python bindings</h3>
<div class="outline-text-3" id="text-6-2">

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 2013-10-30</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Preliminary evaluations: OpenERP, Tryton</h3>
<div class="outline-text-3" id="text-7-1">

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Wiki editing</h3>
<div class="outline-text-3" id="text-7-2">

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 2013-10-31</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Preliminary evaluations: ADempiere, Phreedom, TurboCASH</h3>
<div class="outline-text-3" id="text-8-1">

</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Call for comments</h3>
<div class="outline-text-3" id="text-8-2">


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-11-08T20:48+0100</p>
<p class="author">Author: Joar Wandborg</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
